Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dmlc-autoscale-af8b9dc7"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-amer-us-west4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-west4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "asg-forwarding-rule-us-west4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-west4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-us-west4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-west40"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "asg-group-manager-amer-us-west4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-west4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922224416500400000001"
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-west4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "asg-target-pool-us-west4"
      + project          = (known after apply)
      + region           = "us-west4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-west4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dmlc-autoscale-0516c432"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "australia-southeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-ocea-australia-southeast1"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "australia-southeast1-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "asg-forwarding-rule-australia-southeast1"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "australia-southeast1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-australia-southeast1"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-ocea-australia-southeast10"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "asg-group-manager-ocea-australia-southeast1"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "australia-southeast1-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922224925972000000001"
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-australia-southeast1",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "asg-target-pool-australia-southeast1"
      + project          = (known after apply)
      + region           = "australia-southeast1"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.australia-southeast1.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`
</details>

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be destroyed
- resource "google_compute_address" "asg" {
      - address            = "34.65.91.7" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2020-09-22T16:29:55.038-07:00" -> null
      - id                 = "projects/2036174436/regions/europe-west6/addresses/dmlc-autoscale-cbb86b7c" -> null
      - name               = "dmlc-autoscale-cbb86b7c" -> null
      - network_tier       = "PREMIUM" -> null
      - project            = "2036174436" -> null
      - region             = "europe-west6" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/addresses/dmlc-autoscale-cbb86b7c" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6",
        ] -> null
    }

  # google_compute_autoscaler.asg[0] will be destroyed
- resource "google_compute_autoscaler" "asg" {
      - creation_timestamp = "2020-09-22T16:30:30.872-07:00" -> null
      - id                 = "projects/2036174436/zones/europe-west6-a/autoscalers/asg-euro-europe-west6" -> null
      - name               = "asg-euro-europe-west6" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/autoscalers/asg-euro-europe-west6" -> null
      - target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a" -> null

      - autoscaling_policy {
          - cooldown_period = 60 -> null
          - max_replicas    = 2 -> null
          - min_replicas    = 2 -> null
          - mode            = "ON" -> null

          - cpu_utilization {
              - target = 0.5 -> null
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be destroyed
- resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      - creation_timestamp    = "2020-09-22T16:30:17.670-07:00" -> null
      - id                    = "projects/2036174436/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6" -> null
      - ip_address            = "34.65.91.7" -> null
      - ip_protocol           = "TCP" -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "asg-forwarding-rule-europe-west6" -> null
      - network_tier          = "PREMIUM" -> null
      - port_range            = "443-443" -> null
      - ports                 = [] -> null
      - project               = "2036174436" -> null
      - region                = "europe-west6" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6" -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
    }

  # google_compute_http_health_check.asg[0] will be destroyed
- resource "google_compute_http_health_check" "asg" {
      - check_interval_sec  = 30 -> null
      - creation_timestamp  = "2020-09-22T16:29:54.945-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/2036174436/global/httpHealthChecks/asg-health-check-europe-west6" -> null
      - name                = "asg-health-check-europe-west6" -> null
      - port                = 80 -> null
      - project             = "2036174436" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-europe-west6" -> null
      - timeout_sec         = 3 -> null
      - unhealthy_threshold = 2 -> null
    }

  # google_compute_instance_group_manager.asg[0] will be destroyed
- resource "google_compute_instance_group_manager" "asg" {
      - base_instance_name = "frontend-asg-euro-europe-west60" -> null
      - fingerprint        = "ErRpURSoxRc=" -> null
      - id                 = "projects/2036174436/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - instance_group     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroups/asg-group-manager-euro-europe-west6" -> null
      - name               = "asg-group-manager-euro-europe-west6" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - target_pools       = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6",
        ] -> null
      - target_size        = 2 -> null
      - wait_for_instances = false -> null
      - zone               = "europe-west6-a" -> null

      - update_policy {
          - max_surge_fixed         = 1 -> null
          - max_surge_percent       = 0 -> null
          - max_unavailable_fixed   = 1 -> null
          - max_unavailable_percent = 0 -> null
          - min_ready_sec           = 0 -> null
          - minimal_action          = "REPLACE" -> null
          - type                    = "OPPORTUNISTIC" -> null
        }

      - version {
          - instance_template = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922224758257900000001" -> null
        }
    }

  # google_compute_target_pool.asg[0] will be destroyed
- resource "google_compute_target_pool" "asg" {
      - failover_ratio   = 0 -> null
      - health_checks    = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-europe-west6",
        ] -> null
      - id               = "projects/2036174436/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
      - instances        = [
          - "europe-west6-a/frontend-asg-euro-europe-west60-ck49",
          - "europe-west6-a/frontend-asg-euro-europe-west60-k62d",
        ] -> null
      - name             = "asg-target-pool-europe-west6" -> null
      - project          = "2036174436" -> null
      - region           = "europe-west6" -> null
      - self_link        = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
      - session_affinity = "NONE" -> null
    }

  # google_dns_record_set.asg[0] will be destroyed
- resource "google_dns_record_set" "asg" {
      - id           = "dmlc/frontend-asg.europe-west6.dmlc.pw./A" -> null
      - managed_zone = "dmlc" -> null
      - name         = "frontend-asg.europe-west6.dmlc.pw." -> null
      - project      = "2036174436" -> null
      - rrdatas      = [
          - "34.65.91.7",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

Plan: 0 to add, 0 to change, 7 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
